import React from 'react';
import './WhyChooseUs.css';

const WhyChooseUs = () => {
    return (
        <section id="why-choose-us">
            <div className="container">
                <h2>لماذا تختارنا</h2>
                <div className="reasons">
                    <div className="reason">
                        <h3>الخبرة والتجربة</h3>
                        <p><strong>فريق عالي المهارة</strong>: يتمتع فريقنا بمزيج من المطورين والمصممين ومديري المشاريع المحترفين الذين يمتلكون سنوات من الخبرة في هذا المجال.</p>
                        <p><strong>مشاريع متنوعة</strong>: لقد قمنا بتنفيذ مشاريع ناجحة في مختلف الصناعات، مما يعكس قدرتنا على التعامل مع جميع أنواع التحديات وتقديم حلول متنوعة.</p>
                    </div>
                    <div className="reason">
                        <h3>حلول مبتكرة</h3>
                        <p><strong>تقنية حديثة</strong>: نستخدم أحدث التقنيات والأساليب لضمان أن حلولنا تكون دائمًا في طليعة الابتكار.</p>
                        <p><strong>تطوير خاص</strong>: نقدم حلولاً مخصصة تمامًا لتلبية احتياجات وأهداف عملك الفريدة، مما يضمن لك الحصول على أفضل النتائج الممكنة.</p>
                    </div>
                    <div className="reason">
                        <h3>نهج موجه للعميل</h3>
                        <p><strong>دعم مستمر</strong>: نحن نقدم دعمًا مستمرًا وصيانة لضمان أن موقعك يعمل بشكل مثالي على الدوام.</p>
                        <p><strong>عملية تعاونية</strong>: نعمل عن كثب معك في كل خطوة من خطوات المشروع، مما يضمن أن تكون مشاركًا في جميع القرارات وأن تحصل على النتيجة التي تتطلع إليها.</p>
                    </div>
                    <div className="reason">
                        <h3>نتائج واضحة</h3>
                        <p><strong>تحقيق الأهداف</strong>: نركز على تحقيق أهداف عملك من خلال تصميم وتطوير مواقع تساهم في نموك وتوسعك.</p>
                        <p><strong>تقارير شفافة</strong>: نوفر تقارير شفافة ومنتظمة حول تقدم المشروع وأداء الموقع، مما يتيح لك متابعة النجاح والتطور.</p>
                    </div>
                    <div className="reason">
                        <h3>التزام بالجودة</h3>
                        <p><strong>معايير عالية</strong>: نلتزم بأعلى معايير الجودة في جميع جوانب عملنا، من التصميم إلى التطوير والدعم.</p>
                        <p><strong>تطوير مستمر</strong>: نحن نعمل باستمرار على تحسين وتطوير مهاراتنا وأساليبنا لضمان تقديم الأفضل لعملائنا.</p>
                    </div>
                </div>
            </div>
        </section>
    );
};

export default WhyChooseUs;
